{
  "meta": {
    "gameTitle": "911 (temp)",
    "setting": "1990s Detroit, USA",
    "totalScenes": 10,
    "note": "No saves. Reload restarts from Scene 1."
  },
  "scenes": [
    {
      "id": "scene1",
      "title": "Morning  Missing Breakfast",
      "illustration": "/assets/scene01.webp",
      "storyText": "Before the alarm clock could ring, the refrigerator's motor gave a low groan.\nWhen I opened the door, the cold air felt strangely energetic.\nNo milk. The egg carton was light, too.\nOutside the window, Detroit morning smudged the street in pale exhaust.\nMary had already left for work; only a note remained.\nPick up groceries on your way back today, okay?\nShe'd asked yesterday. It was today now.\nLily looked like she was waiting for cocoa.\nTommy was practicing tying his shoelaces.\nA father's day starts tilting from these small shortages.\nI patted my jacket pocket and felt how thin my wallet was.",
      "choices": [
        {
          "label": "A",
          "text": "Go to the usual diner and grab something quick for everyone.",
          "next": "scene2"
        },
        {
          "label": "B",
          "text": "Skip breakfast and head to work early.",
          "next": "bad_scene01_b"
        }
      ]
    },
    {
      "id": "scene2",
      "title": "Morning  The Diner and the Ring",
      "illustration": "/assets/scene02.webp",
      "storyText": "The diner's doorbell always rings a beat late.\nThe smell of grease and coffee loosens your shoulders before you even sit down.\nThe waitress, a familiar face, guides us to a booth with a grin.\nSomething's wrong with the phone this morning, she says. It keeps saying nine-one-one.\nThe wall phone did ring onceshort and sharp.\nThen it stopped, and the place swallowed the silence like nothing happened.\nOutside: a school bus, a newspaper kid, and the far howl of a siren.\nI picture pancakes for the family.\nAnd still, for some reason, someone's breathing lingers in my ear.\nMaybe the right way to start a day is not to leave a feeling like this unattended.",
      "choices": [
        {
          "label": "A",
          "text": "Ask what happened and check the phone receiver once.",
          "next": "scene3"
        },
        {
          "label": "B",
          "text": "Ignore it, pay quickly, and step outside.",
          "next": "bad_scene02_b"
        }
      ]
    },
    {
      "id": "scene3",
      "title": "Morning  Leaden Sky",
      "illustration": "/assets/scene03.webp",
      "storyText": "The car is old, but the engine still has grit.\nAM radio. The news repeats the same words until they turn to static.\nEmergency lines. Routing issues. Misconnections.\nMy company is out in the suburbsnormally one straight shot on the highway.\nBut the sky today is a heavy, leaden gray.\nAt an intersection, the light seems to change a fraction of a beat too late.\nIt's tiny. And tiny delays are where accidents begin.\nSpeeding up is easy. Slowing down takes nerve.\nAlong the edge of the windshield, a black bird keeps pace at the same height.\nI know I can't catch it.",
      "choices": [
        {
          "label": "A",
          "text": "Stay on the main road and drive carefully.",
          "next": "scene4"
        },
        {
          "label": "B",
          "text": "Take a shortcut through the back streets.",
          "next": "bad_scene03_b"
        }
      ]
    },
    {
      "id": "scene4",
      "title": "Morning  No Badge",
      "illustration": "/assets/scene04.webp",
      "storyText": "The company parking lot smells like metal in the morning cold.\nAt the security gate, people line up in sleepy, practiced order.\nI reach for my chest pocket and feel nothing but fabric.\nMy badge is gone.\nMaybe it slipped between the couch cushions.\nMaybe I set it down while helping with homework.\nThe guard's face stays blank, but his eyes are busy.\nProcedure is a hassle.\nBut it's also a ritual that keeps accidents from happening.\nI say my own name silently, making sure it still fits.",
      "choices": [
        {
          "label": "A",
          "text": "Explain and follow the proper check-in procedure.",
          "next": "scene5"
        },
        {
          "label": "B",
          "text": "Slip in behind someone and get through the gate.",
          "next": "bad_scene04_b"
        }
      ]
    },
    {
      "id": "scene5",
      "title": "Noon  The Vending Machine",
      "illustration": "/assets/scene05.webp",
      "storyText": "Noon. The office air tastes of paper and fluorescent light.\nThe numbers from the meeting roll through my head like coins.\nFrank claps my shoulder and laughs.\nLunch? The vending machine's enough.\nIt's old. The labels are worn down.\nC3 looks like G3.\nPress wrong, and something else drops.\nAnd it's not only snacks that drop like that.\nA worry falls into your gut the same way.\nI think of the kids at breakfast and listen to my stomach.",
      "choices": [
        {
          "label": "A",
          "text": "Double-check the label and choose carefully.",
          "next": "scene6"
        },
        {
          "label": "B",
          "text": "Just press a buttonanything is fine.",
          "next": "bad_scene05_b"
        }
      ]
    },
    {
      "id": "scene6",
      "title": "Evening  The Detour",
      "illustration": "/assets/scene06.webp",
      "storyText": "When work ends, the city's noise steps forward all at once.\nHorns in rush hour, a distant siren, the beep of a checkout scanner.\nIn the parking lot, turning the key, I remember the empty fridge.\nForgetting groceries stops being one person's mistake the moment you get home.\nThe supermarket is a detour.\nBut detours are sometimes the safest route.\nThe radio insists: misdirected emergency calls are being resolved. Please remain calm.\nStaying calm is hard.\nStill, I know what I need to do.",
      "choices": [
        {
          "label": "A",
          "text": "Stop by the supermarket before going home.",
          "next": "scene7"
        },
        {
          "label": "B",
          "text": "Go straight home and deal with it later.",
          "next": "bad_scene06_b"
        }
      ]
    },
    {
      "id": "scene7",
      "title": "Evening  Homework and Notes",
      "illustration": "/assets/scene07.webp",
      "storyText": "I open the front door and the smell of home pushes back the smell of work.\nEvening light is thin; the curtains cast long shadows on the floor.\nLily's poster board on the table looks like a galaxy of clutter.\nDad, I have to build a volcano by tomorrow. I need styrofoam.\nTommy watches TV, but the volume is too lowso low it's unsettling.\nAnother note has appeared on the refrigerator.\nThe word please looks darker than yesterday.\nA father's job is to help.\nNot helping is easy.\nAnd whenever I choose the easy way, the sirens outside feel a little closer.",
      "choices": [
        {
          "label": "A",
          "text": "Help Lily with the project and check on Tommy.",
          "next": "scene8"
        },
        {
          "label": "B",
          "text": "Tell them you're tired and sit down for a minute.",
          "next": "bad_scene07_b"
        }
      ]
    },
    {
      "id": "scene8",
      "title": "Night  A Neighbor's Knock",
      "illustration": "/assets/scene08.webp",
      "storyText": "After sunset, Detroit turns suddenly quiet.\nSo quiet the house's creaks sound like conversation.\nA knock. Twice. Evenly spaced.\nMr. Hudson from next door stands there, hat in hand.\nSorry, David. There's a weird smell out back. Like something's burning.\nBurning is just another word for fire.\nFire is why you call.\nCallingtonightfeels unreliable.\nBut fire doesn't wait.\nI feel my family's breathing behind me and look into the dark.",
      "choices": [
        {
          "label": "A",
          "text": "Go outside with Hudson and check the smell.",
          "next": "scene9"
        },
        {
          "label": "B",
          "text": "Dismiss it and close the door for the night.",
          "next": "bad_scene08_b"
        }
      ]
    },
    {
      "id": "scene9",
      "title": "Night  The Voice in the Noise",
      "illustration": "/assets/scene09.webp",
      "storyText": "The air behind the house is cold, and the burnt smell is real.\nBut I can't see flames. No smoke.\nA fire you can't see is the worst kind.\nBack inside, the phone rings againthis time clearly.\nThe line is a nest of noise, and inside it a woman's voice.\nThis is nine-one-one. Can you hear me?\nIt says 911, but it feels far away.\nShe recites my address. She knows how many people are in my house.\nMy throat dries out.\nA wrong number shouldn't know that much.",
      "choices": [
        {
          "label": "A",
          "text": "Keep her talking and do exactly what she says.",
          "next": "scene10"
        },
        {
          "label": "B",
          "text": "Hang up. It has to be a prank.",
          "next": "bad_scene09_b"
        }
      ]
    },
    {
      "id": "scene10",
      "title": "Night  The Fuse Box",
      "illustration": "/assets/scene10.webp",
      "storyText": "Her voice stays calmtoo calm.\nGo to the basement fuse box right now. The smell isn't fire. It's electricity.\nThe basement stairs are dark, the wooden rail damp to the touch.\nMy flashlight cuts old appliances and cardboard into pieces.\nAt the fuse box, I find it: a run of wire blackened, but not yet burning.\nIf I act now, I can stop it.\nBut deeper in the basement is another door.\nSince when was that there?\nI reach out, and choose where my hand goes.",
      "choices": [
        {
          "label": "A",
          "text": "Cut the power at the fuse box first.",
          "next": "clear"
        },
        {
          "label": "B",
          "text": "Open the strange door in the back first.",
          "next": "bad_scene10_b"
        }
      ]
    }
  ],
  "badEnds": [
    {
      "id": "bad_scene01_b",
      "title": "BAD END  Early Shift",
      "illustration": "/assets/bad_scene01.webp",
      "deathText": "David skipped breakfast and reached the company early.\n7:30 AM. The front gate wasn't even open yet.\nHard work sometimes just spins its wheels.\nWhen I cut around to the service entrance, two shadows waited where no one should be.\nThe moment they turned, it felt like they'd been expecting my shift.\nA blunt impact rang inside my skull. The world warped.\nThe ambulance siren drifted farther and farther away.\nBut somehow, the only bell that kept ringing was a phonedeep in my ear.\nAs the stretcher rolled, I heard a voice like the diner waitress: the phone's been weird today.\nI never managed to answer before the dark took me."
    },
    {
      "id": "bad_scene02_b",
      "title": "BAD END  Ice",
      "illustration": "/assets/bad_scene02.webp",
      "deathText": "I rushed the bill and hurried the family outside.\nThe doorbell rang a beat lateand in that beat, my foot slid.\nMy head met frozen pavement.\nPain came second. First came the hiss of phone noise blooming in my ear.\nSomeone shouted to call an ambulance.\nBut the diner phone wouldn't reach 911.\nInstead it connected to an unfamiliar voicemail.\nA woman's voice repeating: this is this is\nThe bleeding shouldn't have been much, but my awareness tore like thin paper.\nThe last sound I heard wasn't a bell or a sirenjust metal hitting the ground."
    },
    {
      "id": "bad_scene03_b",
      "title": "BAD END  Shortcut",
      "illustration": "/assets/bad_scene03.webp",
      "deathText": "A shortcut shows you the city's underside.\nThe factory walls are covered in graffiti; the windows are faces without eyes.\nThe radio cuts out, replaced by sirens crawling into the car.\nBefore I could locate them, the road sank.\nHollow underneath.\nThe car tipped, and my world became a slanted angle.\nNo signal. The payphone was broken.\nThe number that should have helped routed to someone else.\nOn the other end, a woman said calmly: I thought you'd choose this way."
    },
    {
      "id": "bad_scene04_b",
      "title": "BAD END  Wrong Exit",
      "illustration": "/assets/bad_scene04.webp",
      "deathText": "I slipped through the gate behind a coworker. The alarm didn't sound.\nNo alarm is worse.\nThe hallway lights didn't flickerthey blinked, like an eye.\nThe guard looked over too late.\nYou're not supposed to be here today.\nThen the PA system glitched and broadcast FIRE across the whole building.\nExit signs flipped, pointing the wrong way.\nThe crowd surged to one doorand the door never opened.\nI fell. A shoe pressed into my chest.\nThe last thing I heard wasn't the fire bell. It was a phone ringing."
    },
    {
      "id": "bad_scene05_b",
      "title": "BAD END  Wrong Button",
      "illustration": "/assets/bad_scene05.webp",
      "deathText": "The vending machine labels were worn down. C3 looked like G3.\nWhat fell wasn't a snackit was an old emergency whistle.\nFrank laughed. He couldn't stop.\nI blew the whistle. No sound came out.\nInstead, every phone in the office rang at once.\nIt rang, and nobody answered.\nMy stomach clenchedthis wasn't hunger.\nAt the edge of my vision, coworkers thinned like paper.\nAs I went down, one thought stuck: I should have reached the right number."
    },
    {
      "id": "bad_scene06_b",
      "title": "BAD END  Dead Batteries",
      "illustration": "/assets/bad_scene06.webp",
      "deathText": "A traffic light appeared where it shouldn't exist.\nThe green was too short, and the cars behind me grew angry.\nAt home, my flashlight was dead, and the basement's black got thicker.\nIn that dark, something flashed white behind the wiring.\nA spark ran. The burnt smell surged.\nThe phone rang, and the woman said, calm as ever: if you'd bought batteries, you would have seen it.\nI couldn't see. And the burnt air slid into my throat.\nHelp never reached a number that mattered."
    },
    {
      "id": "bad_scene07_b",
      "title": "BAD END  Just a Minute",
      "illustration": "/assets/bad_scene07.webp",
      "deathText": "The couch takes your weight like it was made for you.\nI meant to rest just for a minute.\nBut just for a minute multiplies.\nSomething scraped in the kitchen.\nI turned too late.\nLate is only a beatuntil a beat becomes a disaster.\nCuriosity touches the word gas.\nI grabbed the phone and tried to dial 911, but the TV spoke first.\nThe anchor read my address out loud.\nCalls may be misrouted\nThen the anchor looked at me and mouthed: too late."
    },
    {
      "id": "bad_scene08_b",
      "title": "BAD END  Smoke Alarm",
      "illustration": "/assets/bad_scene08.webp",
      "deathText": "I shut the door, and the burnt smell stayed inside.\nA smell that lingers is usually real.\nAt midnight, the smoke alarm went off.\nIt rang politelylike a phone bell.\nDownstairs, the wiring was black and the insulation had melted.\nThe fire was still small, but the exit felt far away.\nThe front lock wouldn't turn.\nSomething was stuffed in the keyholepaper, jammed deep.\nOn it, three digits: 911.\nOutside, Hudson said: I tried to call for help. It won't connect."
    },
    {
      "id": "bad_scene09_b",
      "title": "BAD END  Cut Line",
      "illustration": "/assets/bad_scene09.webp",
      "deathText": "When I hung up, the room's silence got heavier.\nHeavier silence has weight.\nIn the basement, the back door clicked on its own.\nNo receiver in my handyet the woman's voice was clear: you cut the line. So you'll hear it alone.\nBefore I could ask what, a small flash bloomed inside the fuse box.\nBeautiful like fireworks. And then it stole the air."
    },
    {
      "id": "bad_scene10_b",
      "title": "BAD END  The Phone Room",
      "illustration": "/assets/bad_scene10.webp",
      "deathText": "The back door opened too easily.\nA door that light is closer to a dream than to reality.\nInside was a narrow room lined with old telephones.\nEvery cord was cut.\nAnd still, they all rang at once.\nNewspaper clippings littered the floorheadlines blurred by damp ink.\nOne line seemed to float up: the man who didn't cut the power was misrouted with his whole house.\nBehind me, the wiring made a sound like burning.\nIt wasn't the house that was burning.\nIt was the possibility of going back."
    }
  ],
  "clear": {
    "id": "clear",
    "title": "GAME CLEAR",
    "illustration": "/assets/clear.webp",
    "clearText": "When I cut the fuse, the house went silent for exactly one beat.\nThe refrigerator's groan, the clock's ticking, the distant sirenseverything.\nIn that darkness I counted my family's breathing.\nIf you can count it, you can still protect it.\nUpstairs, the phone was ringing.\nBut before I could pick up, the answering machine played by itself.\nHer voice sounded more human than ever.\nThis is 911. The misconnection has been resolved.\nYou chose the right order today.\nThe ordinary fact that tomorrow will come felt both the strangest and the most beautiful thing.\nThe phone never rang again."
  }
}
